**การสำรวจข้อมูลเบื้องต้น 1 (Basic Data exploration)**

In [3]:
import pandas as pd

In [4]:
#https://github.com/mathawanup/master_data/blob/master/customer.tsv
url='https://raw.githubusercontent.com/mathawanup/master_data/master/customer.tsv'
df=pd.read_table(url)
df.head()

  gender  birthdate  occupation  work_exp    salary  own_house  children
0      M  31-Jul-89       nurse       2.2  223700.0       True         1
1    NaN  30-Oct-92     dentist       6.7  121100.0       True         1
2      F        NaN  accountant       9.0       NaN      False         2
3      F  17-Sep-87    engineer       1.7   79900.0      False         0
4      M  24-Jan-93     teacher       3.6   32800.0      False         2

In [5]:
#สำรวจดูรายละเอียดของ df  dataframe

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 170 entries, 0 to 169
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   gender      153 non-null    object
 1   birthdate   136 non-null    object
 2   occupation  170 non-null    object
 3   work_exp    170 non-null    float64
 4   salary      136 non-null    float64
 5   own_house   170 non-null    bool
 6   children    170 non-null    int64
dtypes: bool(1), float64(2), int64(1), object(3)
memory usage: 8.3+ KB

In [7]:
 #object to dateTime using Parse_date
df = pd.read_table(url, parse_dates = ['birthdate'])
df.head()

  gender  birthdate  occupation  work_exp    salary  own_house  children
0      M 1989-07-31       nurse       2.2  223700.0       True         1
1    NaN 1992-10-30     dentist       6.7  121100.0       True         1
2      F        NaT  accountant       9.0       NaN      False         2
3      F 1987-09-17    engineer       1.7   79900.0      False         0
4      M 1993-01-24     teacher       3.6   32800.0      False         2

In [8]:
# สุ่มแถว

In [10]:
df.sample()

   gender  birthdate occupation  work_exp    salary  own_house  children
88      M 1994-12-04    teacher       3.3  141300.0       True         0

In [11]:
#default 5 แถวสุดท้าย

In [12]:
df.tail()

    gender  birthdate occupation  work_exp    salary  own_house  children
165      F        NaT  developer       1.8       NaN       True         1
166      F 1994-09-26      nurse       5.6  272500.0      False         1
167      M 1991-05-07     lawyer       4.1   41600.0      False         0
168      M 1994-12-04    teacher       3.3  141300.0       True         0
169      M 1987-07-10     police       6.5   68000.0       True         1

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 170 entries, 0 to 169
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   gender      153 non-null    object
 1   birthdate   136 non-null    datetime64[ns]
 2   occupation  170 non-null    object
 3   work_exp    170 non-null    float64
 4   salary      136 non-null    float64
 5   own_house   170 non-null    bool
 6   children    170 non-null    int64
dtypes: bool(1), datetime64[ns](1), float64(2), int64(1), object(2)
memory usage: 8.3+ KB

In [14]:
df['age'] = pd.to_datetime('today').year - df.birthdate.dt.year  
df.head()

  gender  birthdate  occupation  work_exp    salary  own_house  children   age
0      M 1989-07-31       nurse       2.2  223700.0       True         1  31.0
1    NaN 1992-10-30     dentist       6.7  121100.0       True         1  28.0
2      F        NaT  accountant       9.0       NaN      False         2   NaN
3      F 1987-09-17    engineer       1.7   79900.0      False         0  33.0
4      M 1993-01-24     teacher       3.6   32800.0      False         2  27.0

In [15]:
df['Day']=df.birthdate.dt.day_name()
df.head()

,gender,birthdate,occupation,work_exp,salary,own_house,children,age,Day
0,M,1989-07-31,nurse,2.2,223700.0,True,1,31.0,Monday
1,NaN,1992-10-30,dentist,6.7,121100.0,True,1,28.0,Friday
2,F,NaT,accountant,9.0,NaN,False,2,NaN,NaN
3,F,1987-09-17,engineer,1.7,79900.0,False,0,33.0,Thursday
4,M,1993-01-24,teacher,3.6,32800.0,False,2,27.0,Sunday

In [16]:
# function สำหรับ float
df.salary.mean()

122612.5

In [17]:
# function สำหรับ string
df.occupation.str.upper()

0           NURSE
1         DENTIST
2      ACCOUNTANT
3        ENGINEER
4         TEACHER
          ...
165     DEVELOPER
166         NURSE
167        LAWYER
168       TEACHER
169        POLICE
Name: occupation, Length: 170, dtype: object

In [18]:
 # function สำหรับ boolean
df.own_house.value_counts()

True     85
False    85
Name: own_house, dtype: int64

In [19]:
# สถิติเชิงพรรณา
df.occupation.value_counts()

teacher       34
nurse         34
accountant    17
police        17
lawyer        17
dentist       17
developer     17
engineer      17
Name: occupation, dtype: int64

In [20]:
df.describe()

        work_exp         salary    children         age
count  170.00000     136.000000  170.000000  136.000000
mean     4.45000  122612.500000    0.900000   29.125000
std      2.31126   81287.556733    0.702068    2.722846
min      1.70000   32800.000000    0.000000   26.000000
25%      2.20000   61400.000000    0.000000   26.750000
50%      3.85000  100500.000000    1.000000   28.500000
75%      6.50000  161900.000000    1.000000   31.500000
max      9.00000  272500.000000    2.000000   33.000000